#### BuiltInFailures.FabricFailures Members

---

|  |
| --- |
| BuiltInFailures FabricFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures FabricFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | BendDiameterNegative | Fabric Bend Diameter is negative. |
| Public property Static member | BendPolylineInvalid | The bend profile contains too short of a segment to apply the wire bend diameter. Cannot create a bent fabric sheet for this type. |
| Public property Static member | BentHiddenWires | The wires of this custom fabric sheet type are longer than the bending sketch. The linear quantities shown in schedules and tags are not accurate. |
| Public property Static member | CannotPlaceFabricArea | Can't find a host for Fabric Area. |
| Public property Static member | CannotPlaceFabricAreaWarn | Can't find a host for Fabric Area. |
| Public property Static member | CannotPlaceFabricSheet | Can't find a host for Fabric Sheet. |
| Public property Static member | CannotPlaceFabricSheetWarn | Can't find a host for Fabric Sheet. |
| Public property Static member | CoverOffsetTooLong | Cover offset is greater than host thickness. |
| Public property Static member | CoverOffsetTooLongTemp | Cover offset is greater than host thickness - support for transient Single Fabric Sheet in editor. |
| Public property Static member | FabricAreaWrongHost | Fabric Area can be placed only in Structural Floors and straight Structural Walls. |
| Public property Static member | FabricAreaWrongLapSplice | Fabric Area Sheet lap splice is incorrect. Can't create Fabric Area. |
| Public property Static member | FabricAreaWrongSheetAlignment | Fabric Area Sheet Alignment is incorrect. Can't create Fabric Area. |
| Public property Static member | FabricSheetWrongHost | Fabric Sheet can be placed only in Structural Floors and straight Structural Walls. |
| Public property Static member | MajorLapSpliceFailure | The lap splice in the major direction is greater than the half of the overall length. |
| Public property Static member | MajorOverhangFailure | At least one of the overhangs in the major direction is lower than radius of the wire in the minor direction. |
| Public property Static member | MajorSpacingFailure | The spacing in the major direction is lower than diameter of the wire in the minor direction. |
| Public property Static member | MinorLapSpliceFailure | The lap splice in the minor direction is greater than the half of the overall width. |
| Public property Static member | MinorOverhangFailure | At least one of the overhangs in the minor direction is lower than radius of the wire in the major direction. |
| Public property Static member | MinorSpacingFailure | The spacing in the minor direction is lower than diameter of the wire in the major direction. |
| Public property Static member | NoSurfPatternOnWire | Wire elements do not support surface patterns. The surface pattern associated with this material will not be displayed on the indicated Fabric Sheet Type. |
| Public property Static member | NoWireMaterialDensity | Material does not have a density defined. The weight of the Fabric Sheet cannot be computed. |
| Public property Static member | WireDiameterTooLarge | Fabric Wire Diameter is too large. |
| Public property Static member | WrongFabricSheetEndOverhang | Wrong Start Overhang of the Fabric Sheet Type. |
| Public property Static member | WrongFabricSheetLayoutPattern | The Layout Pattern cannot accommodate the current data. Try decreasing the Number of Wires/Spacing. |
| Public property Static member | WrongFabricSheetNumberOfWires | Wrong Number of Wires of the Fabric Sheet Type. |
| Public property Static member | WrongFabricSheetOverallLength | Wrong Overall Length/Width of the Fabric Sheet Type. |
| Public property Static member | WrongFabricSheetSpacing | Wrong Spacing of the Fabric Sheet Type. |
| Public property Static member | WrongFabricSheetStartOverhang | Wrong Start Overhang of the Fabric Sheet Type. |

# See Also

BuiltInFailures FabricFailures Class

Autodesk.Revit.DB Namespace